let res = {
  code: 200,
  msg: '返回成功',
  pager: {
    page_size: 10,
    page_num: 1,
    total: 20481,
    pages: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    skip: 0,
    max_page: 2049,
    page: 1,
    has_more: true,
    enable: true,
  },
  data: [
    {
      laws: [
        {
          clause: null,
          text:
            '为推动实施国家创新驱动发展战略，进一步加强<em>知识</em><em>产权</em>司法保护，切实依法保护权利人合法权益，维护社会公共利益，根据宪法和人民法院组织法，特作如下决定：',
          show_order: 0,
        },
        {
          clause: 1,
          text:
            '一、在北京、上海、广州设立<em>知识</em><em>产权</em>法院。<em>知识</em><em>产权</em>法院审判庭的设置，由最高人民法院根据<em>知识</em><em>产权</em>案件的类型和数量确定。',
          show_order: 1,
        },
        {
          clause: 2,
          text:
            '二、<em>知识</em><em>产权</em>法院管辖有关专利、植物新品种、集成电路布图设计、技术秘密等专业技术性较强的第一审<em>知识</em><em>产权</em>民事和行政案件。不服国务院行政部门裁定或者决定而提起的第一审<em>知识</em><em>产权</em>授权确权行政案件，由北京<em>知识</em><em>产权</em>法院管辖。<em>知识</em><em>产权</em>法院对第一款规定的案件实行跨区域管辖。在<em>知识</em><em>产权</em>法院设立的三年内，可以先在所在省（直辖市）实行跨区域管辖。',
          show_order: 2,
        },
        {
          clause: 3,
          text:
            '三、<em>知识</em><em>产权</em>法院所在市的基层人民法院第一审著作权、商标等<em>知识</em><em>产权</em>民事和行政判决、裁定的上诉案件，由<em>知识</em><em>产权</em>法院审理。',
          show_order: 3,
        },
        {
          clause: 4,
          text:
            '四、<em>知识</em><em>产权</em>法院第一审判决、裁定的上诉案件，由<em>知识</em><em>产权</em>法院所在地的高级人民法院审理。',
          show_order: 4,
        },
        {
          clause: 5,
          text:
            '五、<em>知识</em><em>产权</em>法院审判工作受最高人民法院和所在地的高级人民法院监督。<em>知识</em><em>产权</em>法院依法接受人民检察院法律监督。',
          show_order: 5,
        },
        {
          clause: 6,
          text:
            '六、<em>知识</em><em>产权</em>法院院长由所在地的市人民代表大会常务委员会主任会议提请本级人民代表大会常务委员会任免。<em>知识</em><em>产权</em>法院副院长、庭长、审判员和审判委员会委员，由<em>知识</em><em>产权</em>法院院长提请所在地的市人民代表大会常务委员会任免。<em>知识</em><em>产权</em>法院对所在地的市人民代表大会常务委员会负责并报告工作。',
          show_order: 6,
        },
      ],
      issuing_number: '',
      subject_category: '知识产权综合规定',
      law_type: '有关法律问题的决定',
      location: '全国',
      release_date: '2014-08-31',
      timeliness: '现行有效',
      code_name:
        '全国人大常委会关于在北京、上海、广州设立<em>知识</em><em>产权</em>法院的决定',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5ba318c53bdc7097445668b1',
      implement_date: '2014-08-31',
    },
    {
      laws: [
        {
          clause: 5,
          text:
            '第五条 电子商务经营者从事经营活动，应当遵循自愿、平等、公平、诚信的原则，遵守法律和商业道德，公平参与市场竞争，履行消费者权益保护、环境保护、<em>知识</em><em>产权</em>保护、网络安全与个人信息保护等方面的义务，承担产品和服务质量责任，接受政府和社会的监督。',
          show_order: 18,
        },
        {
          clause: 41,
          text:
            '第四十一条 电子商务平台经营者应当建立<em>知识</em><em>产权</em>保护规则，与<em>知识</em><em>产权</em>权利人加强合作，依法保护<em>知识</em><em>产权</em>。',
          show_order: 56,
        },
        {
          clause: 42,
          text:
            '第四十二条 <em>知识</em><em>产权</em>权利人认为其<em>知识</em><em>产权</em>受到侵害的，有权通知电子商务平台经营者采取删除、屏蔽、断开链接、终止交易和服务等必要措施。通知应当包括构成侵权的初步证据。\n电子商务平台经营者接到通知后，应当及时采取必要措施，并将该通知转送平台内经营者；未及时采取必要措施的，对损害的扩大部分与平台内经营者承担连带责任。\n因通知错误造成平台内经营者损害的，依法承担民事责任。恶意发出错误通知，造成平台内经营者损失的，加倍承担赔偿责任。',
          show_order: 57,
        },
        {
          clause: 43,
          text:
            '第四十三条 平台内经营者接到转送的通知后，可以向电子商务平台经营者提交不存在侵权行为的声明。声明应当包括不存在侵权行为的初步证据。\n电子商务平台经营者接到声明后，应当将该声明转送发出通知的<em>知识</em><em>产权</em>权利人，并告知其可以向有关主管部门投诉或者向人民法院起诉。电子商务平台经营者在转送声明到达<em>知识</em><em>产权</em>权利人后十五日内，未收到权利人已经投诉或者起诉通知的，应当及时终止所采取的措施。',
          show_order: 58,
        },
        {
          clause: 45,
          text:
            '第四十五条 电子商务平台经营者知道或者应当知道平台内经营者侵犯<em>知识</em><em>产权</em>的，应当采取删除、屏蔽、断开链接、终止交易和服务等必要措施；未采取必要措施的，与侵权人承担连带责任。',
          show_order: 60,
        },
        {
          clause: 84,
          text:
            '第八十四条 电子商务平台经营者违反本法第四十二条、第四十五条规定，对平台内经营者实施侵犯<em>知识</em><em>产权</em>行为未依法采取必要措施的，由有关<em>知识</em><em>产权</em>行政部门责令限期改正；逾期不改正的，处五万元以上五十万元以下的罚款；情节严重的，处五十万元以上二百万元以下的罚款。',
          show_order: 103,
        },
        {
          clause: 85,
          text:
            '第八十五条 电子商务经营者违反本法规定，销售的商品或者提供的服务不符合保障人身、财产安全的要求，实施虚假或者引人误解的商业宣传等不正当竞争行为，滥用市场支配地位，或者实施侵犯<em>知识</em><em>产权</em>、侵害消费者权益等行为的，依照有关法律的规定处罚。',
          show_order: 104,
        },
      ],
      issuing_number: '中华人民共和国主席令第七号',
      subject_category: '商务信息化',
      law_type: '法律',
      location: '全国',
      release_date: '2018-08-31',
      timeliness: '现行有效',
      code_name: '中华人民共和国电子商务法',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5bab1d213bdc70974464b350',
      implement_date: '2019-01-01',
    },
    {
      laws: [
        {
          clause: 2,
          text:
            '第二条 本法适用于对外贸易以及与对外贸易有关的<em>知识</em><em>产权</em>保护。\n本法所称对外贸易，是指货物进出口、技术进出口和国际服务贸易。',
          show_order: 16,
        },
        {
          clause: 29,
          text:
            '第二十九条 国家依照有关<em>知识</em><em>产权</em>的法律、行政法规，保护与对外贸易有关的<em>知识</em><em>产权</em>。\n进口货物侵犯<em>知识</em><em>产权</em>，并危害对外贸易秩序的，国务院对外贸易主管部门可以采取在一定期限内禁止侵权人生产、销售的有关货物进口等措施。',
          show_order: 47,
        },
        {
          clause: 30,
          text:
            '第三十条 <em>知识</em><em>产权</em>权利人有阻止被许可人对许可合同中的<em>知识</em><em>产权</em>的有效性提出质疑、进行强制性一揽子许可、在许可合同中规定排他性返授条件等行为之一，并危害对外贸易公平竞争秩序的，国务院对外贸易主管部门可以采取必要的措施消除危害。',
          show_order: 48,
        },
        {
          clause: 31,
          text:
            '第三十一条 其他国家或者地区在<em>知识</em><em>产权</em>保护方面未给予中华人民共和国的法人、其他组织或者个人国民待遇，或者不能对来源于中华人民共和国的货物、技术或者服务提供充分有效的<em>知识</em><em>产权</em>保护的，国务院对外贸易主管部门可以依照本法和其他有关法律、行政法规的规定，并根据中华人民共和国缔结或者参加的国际条约、协定，对与该国家或者该地区的贸易采取必要的措施。',
          show_order: 49,
        },
      ],
      issuing_number: '主席令第15号',
      subject_category: '商务综合规定',
      law_type: '法律',
      location: '全国',
      release_date: '2004-04-06',
      timeliness: '已被修订',
      code_name: '中华人民共和国对外贸易法(2004修订)',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5ba3110a3bdc709744551f0d',
      implement_date: '2004-07-01',
    },
    {
      laws: [
        {
          clause: 2,
          text:
            '第二条 本法适用于对外贸易以及与对外贸易有关的<em>知识</em><em>产权</em>保护。\n本法所称对外贸易，是指货物进出口、技术进出口和国际服务贸易。',
          show_order: 15,
        },
        {
          clause: 29,
          text:
            '第二十九条 国家依照有关<em>知识</em><em>产权</em>的法律、行政法规，保护与对外贸易有关的<em>知识</em><em>产权</em>。\n进口货物侵犯<em>知识</em><em>产权</em>，并危害对外贸易秩序的，国务院对外贸易主管部门可以采取在一定期限内禁止侵权人生产、销售的有关货物进口等措施。',
          show_order: 46,
        },
        {
          clause: 30,
          text:
            '第三十条 <em>知识</em><em>产权</em>权利人有阻止被许可人对许可合同中的<em>知识</em><em>产权</em>的有效性提出质疑、进行强制性一揽子许可、在许可合同中规定排他性返授条件等行为之一，并危害对外贸易公平竞争秩序的，国务院对外贸易主管部门可以采取必要的措施消除危害。',
          show_order: 47,
        },
        {
          clause: 31,
          text:
            '第三十一条 其他国家或者地区在<em>知识</em><em>产权</em>保护方面未给予中华人民共和国的法人、其他组织或者个人国民待遇，或者不能对来源于中华人民共和国的货物、技术或者服务提供充分有效的<em>知识</em><em>产权</em>保护的，国务院对外贸易主管部门可以依照本法和其他有关法律、行政法规的规定，并根据中华人民共和国缔结或者参加的国际条约、协定，对与该国家或者该地区的贸易采取必要的措施。',
          show_order: 48,
        },
      ],
      issuing_number: '中华人民共和国主席令第五十七号',
      subject_category: '商务综合规定',
      law_type: '法律',
      location: '全国',
      release_date: '2016-11-07',
      timeliness: '现行有效',
      code_name: '中华人民共和国对外贸易法（2016修正）',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5ba324193bdc709744576326',
      implement_date: '2016-11-07',
    },
    {
      laws: [
        {
          clause: 7,
          text:
            '第七条 国家制定和实施<em>知识</em><em>产权</em>战略，建立和完善知识产权制度，营造尊重<em>知识</em><em>产权</em>的社会环境，依法保护<em>知识</em><em>产权</em>，激励自主创新。\n企业事业组织和科学技术人员应当增强<em>知识</em><em>产权</em>意识，增强自主创新能力，提高运用、保护和管理<em>知识</em><em>产权</em>的能力。',
          show_order: 19,
        },
        {
          clause: 18,
          text:
            '第十八条 国家鼓励金融机构开展<em>知识</em><em>产权</em>质押业务，鼓励和引导金融机构在信贷等方面支持科学技术应用和高新技术产业发展，鼓励保险机构根据高新技术产业发展的需要开发保险品种。\n政策性金融机构应当在其业务范围内，为科学技术应用和高新技术产业发展优先提供金融服务。',
          show_order: 31,
        },
        {
          clause: 20,
          text:
            '第二十条 利用财政性资金设立的科学技术基金项目或者科学技术计划项目所形成的发明专利权、计算机软件著作权、集成电路布图设计专有权和植物新品种权，除涉及国家安全、国家利益和重大社会公共利益的外，授权项目承担者依法取得。\n项目承担者应当依法实施前款规定的<em>知识</em><em>产权</em>，同时采取保护措施，并就实施和保护情况向项目管理机构提交年度报告；在合理期限内没有实施的，国家可以无偿实施，也可以许可他人有偿实施或者无偿实施。\n项目承担者依法取得的本条第一款规定的<em>知识</em><em>产权</em>，国家为了国家安全、国家利益和重大社会公共利益的需要，可以无偿实施，也可以许可他人有偿实施或者无偿实施。\n项目承担者因实施本条第一款规定的<em>知识</em><em>产权</em>所产生的利益分配，依照有关法律、行政法规的规定执行；法律、行政法规没有规定的，按照约定执行。',
          show_order: 33,
        },
        {
          clause: 21,
          text:
            '第二十一条 国家鼓励利用财政性资金设立的科学技术基金项目或者科学技术计划项目所形成的<em>知识</em><em>产权</em>首先在境内使用。\n前款规定的<em>知识</em><em>产权</em>向境外的组织或者个人转让或者许可境外的组织或者个人独占实施的，应当经项目管理机构批准；法律、行政法规对批准机构另有规定的，依照其规定。',
          show_order: 34,
        },
        {
          clause: 38,
          text:
            '第三十八条 国家依法保护企业研究开发所取得的<em>知识</em><em>产权</em>。企业应当不断提高运用、保护和管理<em>知识</em><em>产权</em>的能力，增强自主创新能力和市场竞争能力。',
          show_order: 52,
        },
        {
          clause: 65,
          text:
            '第六十五条 国务院科学技术行政部门应当会同国务院有关主管部门，建立科学技术研究基地、科学仪器设备和科学技术文献、科学技术数据、科学技术自然资源、科学技术普及资源等科学技术资源的信息系统，及时向社会公布科学技术资源的分布、使用情况。\n科学技术资源的管理单位应当向社会公布所管理的科学技术资源的共享使用制度和使用情况，并根据使用制度安排使用；但是，法律、行政法规规定应当保密的，依照其规定。\n科学技术资源的管理单位不得侵犯科学技术资源使用者的<em>知识</em><em>产权</em>，并应当按照国家有关规定确定收费标准。管理单位和使用者之间的其他权利义务关系由双方约定。',
          show_order: 82,
        },
      ],
      issuing_number: '主席令第82号',
      subject_category: '科学技术综合规定',
      law_type: '法律',
      location: '全国',
      release_date: '2007-12-29',
      timeliness: '现行有效',
      code_name: '中华人民共和国科学技术进步法(2007修订)',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5ba311ae3bdc709744554c56',
      implement_date: '2008-07-01',
    },
    {
      laws: [
        {
          clause: 48,
          text:
            '第四十八条 <em>知识</em><em>产权</em>的归属和内容，适用被请求保护地法律。',
          show_order: 66,
        },
        {
          clause: 49,
          text:
            '第四十九条 当事人可以协议选择<em>知识</em><em>产权</em>转让和许可使用适用的法律。当事人没有选择的，适用本法对合同的有关规定。',
          show_order: 67,
        },
        {
          clause: 50,
          text:
            '第五十条 <em>知识</em><em>产权</em>的侵权责任，适用被请求保护地法律，当事人也可以在侵权行为发生后协议选择适用法院地法律。',
          show_order: 68,
        },
      ],
      issuing_number: '主席令第36号',
      subject_category: '涉外民事关系法律适用',
      law_type: '法律',
      location: '全国',
      release_date: '2010-10-28',
      timeliness: '现行有效',
      code_name: '中华人民共和国涉外民事关系法律适用法',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5b920ada1b79315c569f2c05',
      implement_date: '2011-04-01',
    },
    {
      laws: [
        {
          clause: 4,
          text:
            '第四条 中小企业应当依法经营，遵守国家劳动用工、安全生产、职业卫生、社会保障、资源环境、质量标准、<em>知识</em><em>产权</em>、财政税收等方面的法律、法规，遵循诚信原则，规范内部管理，提高经营管理水平；不得损害劳动者合法权益，不得损害社会公共利益。',
          show_order: 7,
        },
        {
          clause: 19,
          text:
            '第十九条 国家完善担保融资制度，支持金融机构为中小企业提供以应收账款、<em>知识</em><em>产权</em>、存货、机器设备等为担保品的担保融资。',
          show_order: 24,
        },
        {
          clause: 35,
          text:
            '第三十五条 国家鼓励中小企业研究开发拥有自主<em>知识</em><em>产权</em>的技术和产品，规范内部<em>知识</em><em>产权</em>管理，提升保护和运用<em>知识</em><em>产权</em>的能力；鼓励中小企业投保<em>知识</em><em>产权</em>保险；减轻中小企业申请和维持<em>知识</em><em>产权</em>的费用等负担。',
          show_order: 42,
        },
        {
          clause: 41,
          text:
            '第四十一条 县级以上人民政府有关部门应当在法律咨询、<em>知识</em><em>产权</em>保护、技术性贸易措施、产品认证等方面为中小企业产品和服务出口提供指导和帮助，推动对外经济技术合作与交流。\n国家有关政策性金融机构应当通过开展进出口信贷、出口信用保险等业务，支持中小企业开拓境外市场。',
          show_order: 49,
        },
        {
          clause: 46,
          text:
            '第四十六条 国家鼓励各类服务机构为中小企业提供创业培训与辅导、<em>知识</em><em>产权</em>保护、管理咨询、信息咨询、信用服务、市场营销、项目开发、投资融资、财会税务、产权交易、技术支持、人才引进、对外合作、展览展销、法律咨询等服务。',
          show_order: 55,
        },
      ],
      issuing_number: '中华人民共和国主席令第七十四号',
      subject_category: '企业',
      law_type: '法律',
      location: '全国',
      release_date: '2017-09-01',
      timeliness: '现行有效',
      code_name: '中华人民共和国中小企业促进法（2017修订）',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5ba32a453bdc70974457ce21',
      implement_date: '2018-01-01',
    },
    {
      laws: [
        {
          clause: 3,
          text:
            '第三条 科技成果转化活动应当有利于加快实施创新驱动发展战略，促进科技与经济的结合，有利于提高经济效益、社会效益和保护环境、合理利用资源，有利于促进经济建设、社会发展和维护国家安全。\n科技成果转化活动应当尊重市场规律，发挥企业的主体作用，遵循自愿、互利、公平、诚实信用的原则，依照法律法规规定和合同约定，享有权益，承担风险。科技成果转化活动中的<em>知识</em><em>产权</em>受法律保护。\n科技成果转化活动应当遵守法律法规，维护国家利益，不得损害社会公共利益和他人合法权益。',
          show_order: 11,
        },
        {
          clause: 10,
          text:
            '第十条 利用财政资金设立应用类科技项目和其他相关科技项目，有关行政部门、管理机构应当改进和完善科研组织管理方式，在制定相关科技规划、计划和编制项目指南时应当听取相关行业、企业的意见；在组织实施应用类科技项目时，应当明确项目承担者的科技成果转化义务，加强<em>知识</em><em>产权</em>管理，并将科技成果转化和<em>知识</em><em>产权</em>创造、运用作为立项和验收的重要内容和依据。',
          show_order: 19,
        },
        {
          clause: 11,
          text:
            '第十一条 国家建立、完善科技报告制度和科技成果信息系统，向社会公布科技项目实施情况以及科技成果和相关<em>知识</em><em>产权</em>信息，提供科技成果信息查询、筛选等公益服务。公布有关信息不得泄露国家秘密和商业秘密。对不予公布的信息，有关部门应当及时告知相关科技项目承担者。\n利用财政资金设立的科技项目的承担者应当按照规定及时提交相关科技报告，并将科技成果和相关<em>知识</em><em>产权</em>信息汇交到科技成果信息系统。\n国家鼓励利用非财政资金设立的科技项目的承担者提交相关科技报告，将科技成果和相关<em>知识</em><em>产权</em>信息汇交到科技成果信息系统，县级以上人民政府负责相关工作的部门应当为其提供方便。',
          show_order: 20,
        },
        {
          clause: 26,
          text:
            '第二十六条 国家鼓励企业与研究开发机构、高等院校及其他组织采取联合建立研究开发平台、技术转移机构或者技术创新联盟等产学研合作方式，共同开展研究开发、成果应用与推广、标准研究与制定等活动。\n合作各方应当签订协议，依法约定合作的组织形式、任务分工、资金投入、<em>知识</em><em>产权</em>归属、权益分配、风险分担和违约责任等事项。',
          show_order: 35,
        },
        {
          clause: 35,
          text:
            '第三十五条 国家鼓励银行业金融机构在组织形式、管理机制、金融产品和服务等方面进行创新，鼓励开展<em>知识</em><em>产权</em>质押贷款、股权质押贷款等贷款业务，为科技成果转化提供金融支持。\n国家鼓励政策性金融机构采取措施，加大对科技成果转化的金融支持。',
          show_order: 45,
        },
        {
          clause: 46,
          text:
            '第四十六条 利用财政资金设立的科技项目的承担者未依照本法规定提交科技报告、汇交科技成果和相关<em>知识</em><em>产权</em>信息的，由组织实施项目的政府有关部门、管理机构责令改正；情节严重的，予以通报批评，禁止其在一定期限内承担利用财政资金设立的科技项目。\n国家设立的研究开发机构、高等院校未依照本法规定提交科技成果转化情况年度报告的，由其主管部门责令改正；情节严重的，予以通报批评。',
          show_order: 58,
        },
      ],
      issuing_number: '中华人民共和国主席令第三十二号',
      subject_category: '科技成果与知识产权',
      law_type: '法律',
      location: '全国',
      release_date: '2015-08-29',
      timeliness: '现行有效',
      code_name: '中华人民共和国促进科技成果转化法（2015修正）',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5bc46be93bdc70974464b762',
      implement_date: '2015-10-01',
    },
    {
      laws: [
        {
          clause: null,
          text: '第七节　侵犯<em>知识</em><em>产权</em>罪',
          show_order: 40,
        },
        {
          clause: null,
          text: '第七节　侵犯<em>知识</em><em>产权</em>罪',
          show_order: 290,
        },
        {
          clause: 220,
          text:
            '第二百二十条 【单位犯侵犯<em>知识</em><em>产权</em>罪的处罚规定】单位犯本节第二百一十三条至第二百一十九条规定之罪的，对单位判处罚金，并对其直接负责的主管人员和其他直接责任人员，依照本节各该条的规定处罚。',
          show_order: 298,
        },
      ],
      issuing_number: '主席令第83号',
      subject_category: '刑法综合规定与解释',
      law_type: '法律',
      location: '全国',
      release_date: '1997-03-14',
      timeliness: '已被修订',
      code_name: '中华人民共和国刑法',
      issuing_agency: '全国人民代表大会',
      is_star: false,
      code_id: '5ba37e1e3bdc7097445b473c',
      implement_date: '1997-10-01',
    },
    {
      laws: [
        {
          clause: null,
          text: '第七节　侵犯<em>知识</em><em>产权</em>罪',
          show_order: 38,
        },
        {
          clause: null,
          text: '第七节　侵犯<em>知识</em><em>产权</em>罪',
          show_order: 305,
        },
        {
          clause: 220,
          text:
            '第二百二十条 【单位犯侵犯<em>知识</em><em>产权</em>罪的处罚规定】单位犯本节第二百一十三条至第二百一十九条规定之罪的，对单位判处罚金，并对其直接负责的主管人员和其他直接责任人员，依照本节各该条的规定处罚。',
          show_order: 313,
        },
      ],
      issuing_number: '',
      subject_category: '刑法综合规定与解释',
      law_type: '法律',
      location: '全国',
      release_date: '2017-11-04',
      timeliness: '现行有效',
      code_name: '中华人民共和国刑法(2017)',
      issuing_agency: '全国人大常委会',
      is_star: false,
      code_id: '5ba35ac73bdc7097445a130b',
      implement_date: '2017-11-04',
    },
  ],
};

export default res;
